#ifndef _CAMERA_H_
#define _CAMERA_H_

/*------------------------------宏定义区--------------------------------*/

//extern uint8 imgbuff[CAMERA_SIZE];                             //定义存储接收图像的数组
//extern uint8 img_buf[CAMERA_W*CAMERA_H];
#define COL                  188      //摄像头采集到图像的列数
#define ROW                  120      //摄像头采集到图像的行数

/*----------------------------------------------------------------------*/

/*------------------------------变量声明区------------------------------*/

extern uint8 img[ROW][COL];          //摄像头DMA采集完成后，快速拷贝放入此数组

/*----------------------------------------------------------------------*/

/*------------------------------函数声明区------------------------------*/

extern void car_camera_init();      //总钻风摄像头初始化函数

/*----------------------------------------------------------------------*/




#endif



