#ifndef _LCD_H_
#define _LCD_H_

/*------------------------------宏定义枚举-----------------------------*/



/*----------------------------------------------------------------------*/

/*------------------------------变量声明区------------------------------*/

extern Site_t site ;                //显示图像左上角位置
//extern Size_t imgsize ;            //图像大小
//extern Size_t imgsize2;            //抽取后图像大小
//extern Size_t size;                //显示区域图像大小

/*----------------------------------------------------------------------*/

/*------------------------------函数声明区------------------------------*/

extern void LCD1_init();
extern void LCD_CAMERA_show();
extern void LCD_CAMERA_erzhiSHOW();
extern void LCD_CAMERA_BARREL_show();
//extern void LCD_CAMERA_invSHOW();

/*----------------------------------------------------------------------*/






#endif


